InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьУпаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/УпаковкиЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УпаковкиЕдиницыИзмерения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НаборыУпаковок</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Безразмерная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Числитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Знаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинейныеРазмерыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеГруппыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипоразмерыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляетсяВМногооборотнойТаре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеКоличествоУпаковокМногооборотнойТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзмеряемойВеличины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУпаковокНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Возврат при получении формы для анализа.
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Если Параметры.ЗначенияЗаполнения.Свойство("Штрихкод") Тогда
		Запись.Штрихкод = Параметры.ЗначенияЗаполнения.Штрихкод;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Запись, ЭтотОбъект);

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ОбновитьРеквизитыНоменклатуры(Запись, РеквизитыНоменклатуры);
		УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры);
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ШтрихкодыНоменклатуры", Запись.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если ВводДоступен()
		И Источник = "ПодключаемоеОборудование" Тогда
		
		Если ИмяСобытия = "ScanData"
			И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
			
		КонецЕсли;
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Запрос		= Новый Запрос;
	Штрихкод	= СокрЛП(Запись.Штрихкод);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНеуникальныеШтрихкодыНоменклатуры") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыНоменклатуры.Штрихкод						КАК Штрихкод,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Номенклатура)	КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Характеристика)	КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Серия)			КАК Серия,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Упаковка)		КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ШтрихкодыНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
		|		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.РеквизитыДляКонтроляНоменклатуры КАК РеквизитыКонтроляУникальности
		|		ПО СправочникНоменклатура.Видноменклатуры = РеквизитыКонтроляУникальности.Ссылка
		|			И РеквизитыКонтроляУникальности.ИмяРеквизита = &ИмяРеквизитаШтрихкод
		|			И РеквизитыКонтроляУникальности.Уникален
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|	И НЕ (ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|		И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
		|		И ШтрихкодыНоменклатуры.Серия = &Серия
		|		И ШтрихкодыНоменклатуры.Упаковка = &Упаковка
		|		)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыНоменклатуры.Штрихкод						КАК Штрихкод,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Номенклатура)	КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Характеристика)	КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Серия)			КАК Серия,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Упаковка)		КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ШтрихкодыНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.РеквизитыДляКонтроляНоменклатуры КАК РеквизитыКонтроляУникальности
		|		ПО СправочникНоменклатура.Видноменклатуры = РеквизитыКонтроляУникальности.Ссылка
		|			И РеквизитыКонтроляУникальности.ИмяРеквизита = &ИмяРеквизитаШтрихкод
		|			И НЕ РеквизитыКонтроляУникальности.Уникален
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|	И НЕ ЕСТЬNULL(РеквизитыКонтроляУникальности.Уникален, ЛОЖЬ)
		|	И НЕ (ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|		И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
		|		И ШтрихкодыНоменклатуры.Серия = &Серия
		|		И ШтрихкодыНоменклатуры.Упаковка = &Упаковка
		|		)
		|	И ИСТИНА В
		|			(ВЫБРАТЬ
		|				ИСТИНА
		|			ИЗ
		|				Справочник.Номенклатура КАК СправочникНоменклатура
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.РеквизитыДляКонтроляНоменклатуры КАК РеквизитыКонтроля
		|					ПО СправочникНоменклатура.Видноменклатуры = РеквизитыКонтроля.Ссылка
		|						И РеквизитыКонтроля.ИмяРеквизита = &ИмяРеквизитаШтрихкод
		|						И РеквизитыКонтроля.Уникален
		|			ГДЕ
		|				СправочникНоменклатура.Ссылка = &Номенклатура)
		|";
		
		Запрос.УстановитьПараметр("ИмяРеквизитаШтрихкод", "Штрихкод");
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыНоменклатуры.Штрихкод						КАК Штрихкод,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Номенклатура)	КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Характеристика)	КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Серия)			КАК Серия,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Упаковка)		КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|	И НЕ (ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|		И ШтрихкодыНоменклатуры.Характеристика = &Характеристика
		|		И ШтрихкодыНоменклатуры.Серия = &Серия
		|		И ШтрихкодыНоменклатуры.Упаковка = &Упаковка
		|		)
		|";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Штрихкод",		Штрихкод);
	Запрос.УстановитьПараметр("Номенклатура",	Запись.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",	Запись.Характеристика);
	Запрос.УстановитьПараметр("Серия",			Запись.Серия);
	Запрос.УстановитьПараметр("Упаковка",		Запись.Упаковка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Запись.ИсходныйКлючЗаписи.Штрихкод <> Штрихкод Тогда
		ПредставленияНоменклатуры = Новый Массив;
		
		ШаблонНоменклатуры = НСтр("ru = '""%1""'");
		
		ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
										СокрЛП(Выборка.Номенклатура),
										СокрЛП(Выборка.Характеристика));
		ПредставлениеНоменклатуры = СтрШаблон(ШаблонНоменклатуры, ПредставлениеНоменклатуры);
		ПредставленияНоменклатуры.Добавить(ПредставлениеНоменклатуры);
		
		Если Не ПустаяСтрока(Выборка.Серия) Тогда
			ПредставлениеСерии = НСтр("ru = 'с серией ""%1""'");
			ПредставлениеСерии = СтрШаблон(ПредставлениеСерии, СокрЛП(Выборка.Серия));
			
			ПредставленияНоменклатуры.Добавить(ПредставлениеСерии);
		КонецЕсли;
		
		Если Не ПустаяСтрока(Выборка.Упаковка) Тогда
			ПредставлениеУпаковки = НСтр("ru = 'в упаковке ""%1""'");
			ПредставлениеУпаковки = СтрШаблон(ПредставлениеУпаковки, СокрЛП(Выборка.Упаковка));
			
			ПредставленияНоменклатуры.Добавить(ПредставлениеУпаковки);
		КонецЕсли;
		
		ТекстСообщения = НСтр("ru = 'Такой штрихкод уже назначен для номенклатуры %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтрСоединить(ПредставленияНоменклатуры, " "));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "Штрихкод", "Запись", Отказ);
	КонецЕсли;
	
	НоменклатураЛокализация.ОбработкаПроверкиЗаполненияШтрихкодыНоменклатуры(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьРеквизитыНоменклатуры(Запись, РеквизитыНоменклатуры);
	УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры);
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СобытияФорм.ПриЗаписиНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	РеквизитыСтроки =
		"Номенклатура,
		|Характеристика,
		|ХарактеристикиИспользуются,
		|СерииИспользуются,
		|Серия,
		|Упаковка,
		|ЕдиницаИзмерения";
	
	//++ Локализация
	ВестиУчетМаркируемойПродукции = ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции();
	Если ВестиУчетМаркируемойПродукции Тогда
		РеквизитыСтроки = РеквизитыСтроки + ",ВидПродукцииИС";
	КонецЕсли;
	//-- Локализация
	
	ТекущаяСтрока = Новый Структура(РеквизитыСтроки);
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Запись);
	
	ЗаполнитьПризнакЕдиницаИзмерения = Новый Структура("Номенклатура", "ЕдиницаИзмерения");
	
	ДействияСтроки = Новый Структура;
	ДействияСтроки.Вставить("ПроверитьХарактеристикуПоВладельцу",		Запись.Характеристика);
	ДействияСтроки.Вставить("ПроверитьСериюПоВладельцу",				Запись.Серия);
	ДействияСтроки.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу",	Запись.Упаковка);
	ДействияСтроки.Вставить("ЗаполнитьПризнакЕдиницаИзмерения",			ЗаполнитьПризнакЕдиницаИзмерения);
	
	//++ Локализация
	Если ВестиУчетМаркируемойПродукции Тогда
		ДействияСтроки.Вставить("ЗаполнитьВидПродукцииИС", Новый Структура("Номенклатура", "ВидПродукцииИС"));
	КонецЕсли;
	//-- Локализация
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, ДействияСтроки, КэшированныеЗначения);
	
	ЗаполнитьЗначенияСвойств(Запись, ТекущаяСтрока);
	
	РеквизитыНоменклатурыШаблон = РеквизитыНоменклатуры();
	ЗаполнитьЗначенияСвойств(РеквизитыНоменклатурыШаблон, ТекущаяСтрока);
	
	РеквизитыНоменклатуры = Новый ФиксированнаяСтруктура(РеквизитыНоменклатурыШаблон);
	
	УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры);
	
	//++ Локализация
	Если ВестиУчетМаркируемойПродукции Тогда
		РеквизитыФормы = Новый Структура;
		РеквизитыФормы.Вставить("ВидПродукцииИС", ТекущаяСтрока.ВидПродукцииИС);
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВидПродукцииИС) Тогда
			РеквизитыФормы.Вставить("ВидУпаковкиИС", Неопределено);
			РеквизитыФормы.Вставить("КоличествоПотребительскихУпаковокИС", 0);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыФормы);
		ИнтеграцияИСУТКлиентСервер.УправлениеЭлементамиФормыШтрихкодаНоменклатуры(ЭтотОбъект);
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	
	РеквизитыНоменклатурыШаблон = РеквизитыНоменклатуры();
	ЗаполнитьЗначенияСвойств(РеквизитыНоменклатурыШаблон, РеквизитыНоменклатуры);
	ЗаполнитьЗначенияСвойств(РеквизитыНоменклатурыШаблон, Запись);
	
	РеквизитыНоменклатуры = Новый ФиксированнаяСтруктура(РеквизитыНоменклатурыШаблон);
	
	УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НовыйШтрихкод(Команда)
	
	ОчиститьСообщения();
	
	Если ЭтоВесовойТовар(Запись.Номенклатура, Запись.Упаковка) Тогда
		Запись.Штрихкод = СформироватьШтрихкодEAN13ВесовогоТовара();
	Иначе
		Запись.Штрихкод = СформироватьШтрихкодEAN13();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	Модифицированность = Истина;
	
	Если ДанныеШтрихкодов.Количество() > 0 Тогда
		Запись.Штрихкод = ДанныеШтрихкодов[ДанныеШтрихкодов.Количество() - 1].Штрихкод;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура Подключаемый_ПриИзмененииЭлемента(Элемент)
	СобытияФормКлиент.ПриИзмененииЭлемента(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоВесовойТовар(Номенклатура, Упаковка)
	
	ТипИзмеряемойВеличины = Неопределено;
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
		|			ТОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения.ТипИзмеряемойВеличины, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины
		|	КОНЕЦ КАК ТипИзмеряемойВеличины
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Ссылка = &Упаковка";
		
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТипИзмеряемойВеличины = Выборка.ТипИзмеряемойВеличины;
		КонецЕсли;
		
	Иначе
		ТипИзмеряемойВеличины = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура,
																			"ЕдиницаИзмерения.ТипИзмеряемойВеличины",
																			Истина);
	КонецЕсли;
	
	Возврат ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Вес;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьШтрихкодEAN13()
	
	Возврат РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьШтрихкодEAN13ВесовогоТовара()
	
	Возврат РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодВесовогоТовараEAN13();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыНоменклатуры()
	
	УпаковкаЕдиницаИзмеренияПоУмолчанию	= ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
	
	РеквизитыНоменклатурыШаблон = Новый Структура;
	РеквизитыНоменклатурыШаблон.Вставить("ХарактеристикиИспользуются",	Ложь);
	РеквизитыНоменклатурыШаблон.Вставить("СерииИспользуются",			Ложь);
	РеквизитыНоменклатурыШаблон.Вставить("Упаковка",					УпаковкаЕдиницаИзмеренияПоУмолчанию);
	РеквизитыНоменклатурыШаблон.Вставить("ЕдиницаИзмерения",			УпаковкаЕдиницаИзмеренияПоУмолчанию);
	
	Возврат РеквизитыНоменклатурыШаблон;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьРеквизитыНоменклатуры(Запись, РеквизитыНоменклатуры)
	
	РеквизитыНоменклатурыШаблон = РеквизитыНоменклатуры();
	ЗаполнитьЗначенияСвойств(РеквизитыНоменклатурыШаблон, Запись);
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ДанныеНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
		|				ИЛИ ДанныеНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
		|				ИЛИ ДанныеНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ								КАК ХарактеристикиИспользуются,
		|	ЕСТЬNULL(ДанныеНоменклатуры.ВидНоменклатуры.ИспользоватьСерии, ЛОЖЬ) КАК СерииИспользуются,
		|	ДанныеНоменклатуры.ЕдиницаИзмерения	КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК ДанныеНоменклатуры
		|ГДЕ
		|	ДанныеНоменклатуры.Ссылка = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(РеквизитыНоменклатурыШаблон, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыНоменклатуры = Новый ФиксированнаяСтруктура(РеквизитыНоменклатурыШаблон);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Элементы, РеквизитыНоменклатуры)
	
	ХарактеристикаПодсказкаВвода	= ?(Не РеквизитыНоменклатуры.ХарактеристикиИспользуются,
										НСтр("ru = '<характеристики не используются>'"),
										"");
	СерияПодсказкаВвода				= ?(Не РеквизитыНоменклатуры.СерииИспользуются,
										НСтр("ru = '<серии не используются>'"),
										"");
	УпаковкаПодсказкаВвода			= ?(Не ЗначениеЗаполнено(РеквизитыНоменклатуры.Упаковка),
										Строка(РеквизитыНоменклатуры.ЕдиницаИзмерения),
										"");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Характеристика",
																	"Доступность",
																	РеквизитыНоменклатуры.ХарактеристикиИспользуются);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Характеристика",
																	"ПодсказкаВвода",
																	ХарактеристикаПодсказкаВвода);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Серия",
																	"Доступность",
																	РеквизитыНоменклатуры.СерииИспользуются);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Серия",
																	"ПодсказкаВвода",
																	СерияПодсказкаВвода);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
																	"Упаковка",
																	"ПодсказкаВвода",
																	УпаковкаПодсказкаВвода);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
